In [11]:
import pandas as pd
india_weather = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'banglore'],
    'temperature': [32,45,28],
    'humidity': [80,60,78]
    })
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           28        78

In [12]:
us_weather = pd.DataFrame({
    'city': ['new-york', 'chicago', 'orlando'],
    'temperature': [32,23,28],
    'humidity': [77,68,72]
    })
us_weather

       city  temperature  humidity
0  new-york           32        77
1   chicago           23        68
2   orlando           28        72

In [13]:
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           28        78
0  new-york           32        77
1   chicago           23        68
2   orlando           28        72